Revit 2026 API

# VertexStreamPositionAddVertices Method

---
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddVertices(
	IList<VertexPosition> vertices
)
```
```vb
Public Sub AddVertices (
	vertices As IList(Of VertexPosition)
)
```
```cpp
public:
void AddVertices(
	IList<VertexPosition^>^ vertices
)
```
```fsharp
member AddVertices :
        vertices : IList<VertexPosition> -> unit
```

#### Parameters

vertices IListVertexPosition

#### Reference

VertexStreamPosition Class

Autodesk.Revit.DB.DirectContext3D Namespace